from pathlib import Path

NS = {
    'w': 'http://schemas.openxmlformats.org/wordprocessingml/2006/main',
    'm': 'http://schemas.openxmlformats.org/officeDocument/2006/math'
}

TEMPLATE = Path("Kursach_template.docx")
TMP_DOCX = Path("tmp_docxtpl.docx")
FINAL_DOCX = Path("Kursach_filled.docx")
IMG_1 = Path("graph.png")
IMG_2 = Path("graph2.png")

# список номинальных напряжений и E24 (используется в расчётах)
nominal_voltages = [
    2.4, 3, 6, 6.3, 9, 10, 12.5, 15,
    20, 24, 27, 30, 40, 48, 60,
    80, 100, 125, 150
]

E_24 = [
    0.1, 0.11, 0.12, 0.13, 0.15, 0.16, 0.18, 0.2, 0.22, 0.24, 0.27, 0.3,
    0.33, 0.36, 0.39, 0.43, 0.47, 0.51, 0.56, 0.62, 0.68, 0.75, 0.82, 0.91,
    1.0, 1.1, 1.2, 1.3, 1.5, 1.6, 1.8, 2.0, 2.2, 2.4, 2.7, 3.0,
    3.3, 3.6, 3.9, 4.3, 4.7, 5.1, 5.6, 6.2, 6.8, 7.5, 8.2, 9.1, 10.0
]

# Варианты (скопированы из вашего кода)
variants = {
    1: {
        "R_n": 4,
        "I_n": 4.5,
        "R_c": [0.5, 0.5, 0.1],
        "K_u": [500, 100, 2],
        "R_vh": [10, 10, 10],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": 0.01
    },
    2: {
        "R_n": 7,
        "I_n": 2.0,
        "R_c": [0.4, 0.2, 0.2],
        "K_u": [400, 40, 4],
        "R_vh": [20, 5, 5],
        "transistors": "ОК, ОК",
        "L_nagr": 0.005
    },
    3: {
        "R_n": 9,
        "I_n": 2.5,
        "R_c": [0.4, 0.3, 0.2],
        "K_u": [100, 20, 5],
        "R_vh": [50, 10, 20],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": 'Отсутствует'
    },
    4: {
        "R_n": 15,
        "I_n": 1.0,
        "R_c": [0.3, 0.2, 0.1],
        "K_u": [400, 25, 1],
        "R_vh": [20, 20, 20],
        "transistors": "ОК, ОК",
        "L_nagr": 'Отсутствует'
    },
    5: {
        "R_n": 5,
        "I_n": 3.0,
        "R_c": [0.2, 0.2, 0.1],
        "K_u": [200, 50, 10],
        "R_vh": [10, 10, 50],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": 'Отсутствует'
    },
    6: {
        "R_n": 8,
        "I_n": 1.5,
        "R_c": [0.5, 0.2, 0.1],
        "K_u": [500, 20, 10],
        "R_vh": [10, 50, 10],
        "transistors": "ОК, ОК",
        "L_nagr": 0.02
    },
    7: {
        "R_n": 11,
        "I_n": 1.0,
        "R_c": [0.3, 0.5, 0.5],
        "K_u": [300, 30, 1],
        "R_vh": [10, 20, 20],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": 'Отсутствует'
    },
    8: {
        "R_n": 4,
        "I_n": 4.0,
        "R_c": [0.4, 0.4, 0.4],
        "K_u": [400, 40, 1],
        "R_vh": [5, 50, 50],
        "transistors": "ОК, ОК",
        "L_nagr": 'Отсутствует'
    },
    9: {
        "R_n": 10,
        "I_n": 1.0,
        "R_c": [0.1, 0.1, 0.1],
        "K_u": [100, 10, 2],
        "R_vh": [100, 5, 10],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": 0.003
    },
    10: {
        "R_n": 5,
        "I_n": 2.0,
        "R_c": [0.1, 0.1, 0.1],
        "K_u": [50, 50, 5],
        "R_vh": [50, 10, 20],
        "transistors": "ОК, ОК",
        "L_nagr": 'Отсутствует'
    },
    11: {
        "R_n": 9,
        "I_n": 2.5,
        "R_c": [0.1, 0.1, 0.1],
        "K_u": [100, 10, 2],
        "R_vh": [100, 20, 50],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": 'Отсутствует'
    },
    12: {
        "R_n": 16,
        "I_n": 1.0,
        "R_c": [0.2, 0.2, 0.2],
        "K_u": [50, 20, 1],
        "R_vh": [50, 10, 5],
        "transistors": "ОК, ОК",
        "L_nagr": 'Отсутствует'
    },
    13: {
        "R_n": 10,
        "I_n": 2.0,
        "R_c": [0.3, 0.5, 0.5],
        "K_u": [300, 30, 1],
        "R_vh": [10, 20, 10],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": 'Отсутствует'
    },
    14: {
        "R_n": 4,
        "I_n": 3.5,
        "R_c": [0.4, 0.4, 0.4],
        "K_u": [400, 40, 1],
        "R_vh": [5, 50, 5],
        "transistors": "ОК, ОК",
        "L_nagr": 0.03
    },
    15: {
        "R_n": 15,
        "I_n": 1.5,
        "R_c": [0.5, 0.1, 0.1],
        "K_u": [500, 50, 2],
        "R_vh": [20, 100, 10],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": "Отсутствует"
    },
    16: {
        "R_n": 7,
        "I_n": 3.5,
        "R_c": [0.4, 0.2, 0.2],
        "K_u": [400, 40, 4],
        "R_vh": [20, 5, 20],
        "transistors": "ОК, ОК",
        "L_nagr": "Отсутствует"
    },
    17: {
        "R_n": 12,
        "I_n": 1.5,
        "R_c": [0.3, 0.2, 0.2],
        "K_u": [300, 50, 5],
        "R_vh": [50, 100, 50],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": 0.01
    },
    18: {
        "R_n": 6,
        "I_n": 3.0,
        "R_c": [0.1, 0.1, 0.1],
        "K_u": [100, 10, 10],
        "R_vh": [10, 50, 50],
        "transistors": "ОК, ОК",
        "L_nagr": "Отсутствует"
    },
    19: {
        "R_n": 13,
        "I_n": 2.0,
        "R_c": [0.5, 0.2, 0.2],
        "K_u": [500, 20, 10],
        "R_vh": [50, 50, 5],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": "Отсутствует"
    },
    20: {
        "R_n": 5,
        "I_n": 3.5,
        "R_c": [0.4, 0.3, 0.3],
        "K_u": [100, 20, 5],
        "R_vh": [50, 10, 100],
        "transistors": "ОК, ОК",
        "L_nagr": 0.04
    },
    21: {
        "R_n": 14,
        "I_n": 1.0,
        "R_c": [0.2, 0.2, 0.2],
        "K_u": [200, 50, 10],
        "R_vh": [10, 10, 100],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": "Отсутствует"
    },
    22: {
        "R_n": 10,
        "I_n": 2.5,
        "R_c": [0.1, 0.1, 0.1],
        "K_u": [300, 40, 2],
        "R_vh": [5, 5, 5],
        "transistors": "ОК, ОК",
        "L_nagr": "Отсутствует"
    },
    23: {
        "R_n": 7,
        "I_n": 3.0,
        "R_c": [0.1, 0.2, 0.2],
        "K_u": [100, 10, 1],
        "R_vh": [10, 5, 20],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": 0.025
    },
    24: {
        "R_n": 12,
        "I_n": 1.0,
        "R_c": [0.2, 0.2, 0.1],
        "K_u": [500, 20, 5],
        "R_vh": [20, 10, 50],
        "transistors": "ОК, ОК",
        "L_nagr": "Отсутствует"
    },
    25: {
        "R_n": 17,
        "I_n": 1.5,
        "R_c": [0.1, 0.1, 0.1],
        "K_u": [400, 25, 15],
        "R_vh": [30, 20, 5],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": "Отсутствует"
    },
    26: {
        "R_n": 6,
        "I_n": 3.5,
        "R_c": [0.25, 0.2, 0.2],
        "K_u": [300, 50, 1],
        "R_vh": [40, 25, 20],
        "transistors": "ОК, ОК",
        "L_nagr": "Отсутствует"
    },
    27: {
        "R_n": 14,
        "I_n": 1.5,
        "R_c": [0.1, 0.2, 0.2],
        "K_u": [100, 5, 5],
        "R_vh": [50, 10, 5],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": 0.01
    },
    28: {
        "R_n": 9,
        "I_n": 1.5,
        "R_c": [0.5, 0.4, 0.4],
        "K_u": [500, 5, 1],
        "R_vh": [100, 50, 10],
        "transistors": "ОК, ОК",
        "L_nagr": "Отсутствует"
    },
    29: {
        "R_n": 4,
        "I_n": 3.0,
        "R_c": [0.3, 0.2, 0.2],
        "K_u": [400, 20, 40],
        "R_vh": [20, 20, 15],
        "transistors": "ОЭ, ОЭ",
        "L_nagr": "Отсутствует"
    }
}
